Samsung/mTower/arch/riscv32/bl808/src/pine64_ox64/nonsecure/main.c
#include <FreeRTOS.h>
#include "semphr.h"
#include "board.h"

#include "tzc_sec_reg.h"
#include "rv_hart.h"
#include "rv_pmp.h"

#define DBG_TAG "MAIN"
#include "log.h"

#include "bflb_uart.h"
#include "bflb_gpio.h"
#include "bflb_clock.h"
#include "bflb_rtc.h"
#include "bflb_flash.h"
#include "bl808_glb.h"
#include "bl808_psram_uhs.h"
#include "bl808_tzc_sec.h"
#include "bl808_ef_cfg.h"
#include "bl808_uhs_phy.h"
#include "board.h"

#include "mem.h"

#ifdef CONFIG_BSP_SDH_SDCARD
#include "sdh_sdcard.h"
#endif

static struct bflb_device_s *uart0;

// static TaskHandle_t consumer_handle;
// static TaskHandle_t producer_handle;

// uint8_t sharedBuf[16];
// SemaphoreHandle_t sem_empty = NULL;
// SemaphoreHandle_t sem_full = NULL;
// SemaphoreHandle_t mtx_lock = NULL;

// static void consumer_task(void *pvParameters)
// {
//     LOG_I("Consumer task enter \r\n");
//     vTaskDelay(1000);
//     LOG_I("Consumer task start \r\n");
//     LOG_I("begin to loop %s\r\n", __FILE__);

//     while (1) {
//         if (xSemaphoreTake(sem_full, portMAX_DELAY) == pdTRUE) {
//             xSemaphoreTake(mtx_lock, portMAX_DELAY);
//             LOG_I("Consumer get:%s\r\n", sharedBuf);
//             xSemaphoreGive(mtx_lock);
//             xSemaphoreGive(sem_empty);
//         } else {
//             LOG_I("Take sem_full fail\r\n");
//         }
//     }

//     vTaskDelete(NULL);
// }

// static void producer_task(void *pvParameters)
// {
//     uint8_t buf = 100;

//     LOG_I("Producer task enter \r\n");
//     vTaskDelay(1000);
//     LOG_I("Producer task start \r\n");

//     while (1) {
//         if (xSemaphoreTake(sem_empty, portMAX_DELAY) == pdTRUE) {
//             xSemaphoreTake(mtx_lock, portMAX_DELAY);
//             buf++;
//             sprintf((char *)sharedBuf, "%d", buf);
//             LOG_I("Producer generates:%s\r\n", sharedBuf);
//             xSemaphoreGive(mtx_lock);
//             xSemaphoreGive(sem_full);
//             vTaskDelay(buf);
//         } else {
//             LOG_I("Take sem_empty fail\r\n");
//         }
//     }

//     vTaskDelete(NULL);
// }

// static int32_t xTaskListTasksShowStack[ 128 ] __attribute__( ( aligned( 32 ) ) ); 

// int main(void)
// {

//     board_init();

//     configASSERT((configMAX_PRIORITIES > 4));

//     /* Create semaphore */
//     vSemaphoreCreateBinary(sem_empty);
//     vSemaphoreCreateBinary(sem_full);
//     vSemaphoreCreateBinary(mtx_lock);

//     if (sem_empty == NULL || sem_full == NULL || mtx_lock == NULL) {
//         LOG_I("Create sem fail\r\n");
//     }


//     LOG_I("Create semaphore is success\r\n");

//     xTaskListTasksShowStack[0] = 0xAABBCCDD;

//     LOG_I("Init PMP\r\n");
//     const pmp_config_entry_t pmp_entry_tab[1] = {
//         /* no access */
//         // [0] = {
//         //     .entry_flag = ENTRY_FLAG_ADDR_NAPOT | ENTRY_FLAG_M_MODE_L,
//         //     .entry_pa_base = 0x80000000,
//         //     .entry_pa_length = PMP_REG_SZ_256M,
//         // },
//         [0] = {
//             .entry_flag = ENTRY_FLAG_ADDR_NAPOT | ENTRY_FLAG_PERM_R,
//             .entry_pa_base = xTaskListTasksShowStack,
//             .entry_pa_length = 512,
//         }
//     };

//     rvpmp_init(pmp_entry_tab, sizeof(pmp_entry_tab) / sizeof(pmp_config_entry_t));

//     LOG_I("Inited PMP\r\n");

//     xTaskListTasksShowStack[0] = 0x11223344;
    
//     LOG_I("Write is success\r\n");



//     LOG_I("[OS] Starting consumer task...\r\n");
//     xTaskCreate(consumer_task, (char *)"consumer_task", 512, NULL, configMAX_PRIORITIES - 2, &consumer_handle);
//     LOG_I("[OS] Starting producer task...\r\n");
//     xTaskCreate(producer_task, (char *)"producer_task", 512, NULL, configMAX_PRIORITIES - 3, &producer_handle);

//     vTaskStartScheduler();

//     while (1) {
//     }
// }


/* Copyright 2019 SiFive, Inc */
/* SPDX-License-Identifier: Apache-2.0 */



/******************************************************************************
 *
 * main() creates one queue, and two tasks.  It then starts the
 * scheduler.
 *
 * The Queue Send Task:
 * The queue send task is implemented by the prvQueueSendTask() function in
 * this file.  prvQueueSendTask() sits in a loop that causes it to repeatedly
 * block for 1000 milliseconds, before sending the value 100 to the queue that
 * was created within main().  Once the value is sent, the task loops
 * back around to block for another 1000 milliseconds...and so on.
 *
 * The Queue Receive Task:
 * The queue receive task is implemented by the prvQueueReceiveTask() function
 * in this file.  prvQueueReceiveTask() sits in a loop where it repeatedly
 * blocks on attempts to read data from the queue that was created within
 * blinky().  When data is received, the task checks the value of the
 * data, and if the value equals the expected 100, writes 'Blink' to the UART
 * (the UART is used in place of the LED to allow easy execution in QEMU).  The
 * 'block time' parameter passed to the queue receive function specifies that
 * the task should be held in the Blocked state indefinitely to wait for data to
 * be available on the queue.  The queue receive task will only leave the
 * Blocked state when the queue send task writes to the queue.  As the queue
 * send task writes to the queue every 1000 milliseconds, the queue receive
 * task leaves the Blocked state every 1000 milliseconds, and therefore toggles
 * the LED every 1 second.
 */

// /* Standard includes. */
// #include <stdio.h>
// #include <string.h>
// #include <unistd.h>

// /* Kernel includes. */
// #include "FreeRTOS.h"
// #include "task.h"
// #include "queue.h"

// /* Freedom metal includes. */
// #include <metal.h>
// #include <metal-platform.h>

// #include <metal/lock.h>
// #include <metal/uart.h>
// #include <metal/interrupt.h>
// #include <metal/clock.h>
// #include <metal/led.h>
// #include <metal/gpio.h>

#include <printf.h>

// extern struct metal_led *led0_red, *led0_green, *led0_blue;

extern pmp_info_t xPmpInfo;

#define CONFIG_APPS_SPY
#define CONFIG_APPS_HELLO_WORLD

