Samsung/mTower/arch/riscv32/bl808/src/pine64_ox64/nonsecure/main.c
/* Priorities used by the tasks. */
#define mainQUEUE_RECEIVE_TASK_PRIORITY		( tskIDLE_PRIORITY + 2 )
#define	mainQUEUE_SEND_TASK_PRIORITY		( tskIDLE_PRIORITY + 1 )

#ifndef _RTL_
/* The 1s value is converted to ticks using the pdMS_TO_TICKS() macro. */
#define mainQUEUE_TICK_COUNT_FOR_1S			pdMS_TO_TICKS( 1000 )
#else
/* For RTL Simulation we reduce the waiting timing, otherwise the simulation 
 * will take too more time */
/* The 10ms value is converted to ticks using the pdMS_TO_TICKS() macro. */
#define mainQUEUE_TICK_COUNT_FOR_1S			pdMS_TO_TICKS( 10 )
#endif
/* The maximum number items the queue can hold.  The priority of the receiving
task is above the priority of the sending task, so the receiving task will
preempt the sending task and remove the queue items each time the sending task
writes to the queue.  Therefore the queue will never have more than one item in
it at any time, and even with a queue length of 1, the sending task will never
find the queue full. */
#define mainQUEUE_LENGTH					( 1 )

#if( portUSING_MPU_WRAPPERS == 1 )
/**
 * @brief Calls the port specific code to raise the privilege.
 *
 * @return pdFALSE if privilege was raised, pdTRUE otherwise.
 */
BaseType_t xPortRaisePrivilege( void ) FREERTOS_SYSTEM_CALL;
extern pmp_info_t xPmpInfo;
#endif

/*-----------------------------------------------------------*/
/*
 * Functions:
 * 		- prvSetupHardware: Setup Hardware according CPU and Board.
 */
static void prvSetupHardware( void );

/*
 * The tasks as described in the comments at the top of this file.
 */
static void prvQueueReceiveTask( void *pvParameters );
static void prvQueueSendTask( void *pvParameters );
// void vTaskCode( void * pvParameters ) FREERTOS_SYSTEM_CALL; // PRIVILEGED_FUNCTION;
static void vTaskCode( void * pvParameters ) PRIVILEGED_FUNCTION;

/**
 * @brief Implements the task which has Read Only access to the memory region
 * ucSharedMemory.
 *
 * @param pvParameters[in] Parameters as passed during task creation.
 */
static void prvROAccessTask( void * pvParameters );

/**
 * @brief Implements the task which has Read Write access to the memory region
 * ucSharedMemory.
 *
 * @param pvParameters[in] Parameters as passed during task creation.
 */
static void prvRWAccessTask( void * pvParameters );

/**
 * @brief Size of the shared memory region.
 */
#define SHARED_MEMORY_SIZE    16

/**
 * @brief Memory region shared between two tasks.
 */
static uint8_t ucSharedMemory[ SHARED_MEMORY_SIZE ] __attribute__( ( aligned( 32 ) ) );
// static uint8_t ucSharedMemory1[ SHARED_MEMORY_SIZE ] __attribute__( ( aligned( 32 ) ) );
// static uint8_t ucSharedMemory2[ SHARED_MEMORY_SIZE ] __attribute__( ( aligned( 32 ) ) );

/*-----------------------------------------------------------*/

/* The queue used by both tasks. */
static QueueHandle_t xQueue = NULL;

// struct metal_cpu *cpu0;
// struct metal_interrupt *cpu_intr, *tmr_intr;
// struct metal_led *led0_red, *led0_green, *led0_blue;

// #define LED_ERROR ((led0_red == NULL) || (led0_green == NULL) || (led0_blue == NULL))

void _putchar(char character){
    bflb_uart_putchar(uart0, character);
}

/* Task to be created. */
// void vTaskCode( void * pvParameters ) FREERTOS_SYSTEM_CALL // PRIVILEGED_FUNCTION
// static void vTaskCode( void * pvParameters ) PRIVILEGED_FUNCTION
// {
// 	unsigned long ulCounter = 0;
// 	char pcWriteBuffer[200];

// 	( void ) pvParameters;

// 	/* Must not just run off the end of a task function, so delete this task.
// 	Note that because this task was created using xTaskCreate() the stack was
// 	allocated dynamically and I have not included any code to free it again. */
// 	// vTaskDelete( NULL );

//     /* The parameter value is expected to be 1 as 1 is passed in the
//     pvParameters value in the call to xTaskCreate() below. */
//     // configASSERT( ( ( uint32_t ) pvParameters ) == 1 );
	
// 	if (portIS_PRIVILEGED() == 1) {
// 		printf("%s task is running in priveleged mode\r\n", pcTaskGetName(NULL));
// 	} else {
// 		printf("%s task is running in unpriveleged mode\r\n", pcTaskGetName(NULL));
// 	}
// 	write( STDOUT_FILENO, "Test task\r\n", strlen( "Test task\r\n" ) );

// 	for( ;; )
//     {
//         /* Task code goes here. */
// 		vTaskDelay(mainQUEUE_TICK_COUNT_FOR_1S);
// 		vTaskList( pcWriteBuffer );
// 		printf("\033[2J\r\n");
// 		printf( pcWriteBuffer );
// 		printf("\r\n");
// 		// printf("[ %s ] : %d\r\n", pcTaskGetName(NULL), ++ulCounter );
// 		// write( STDOUT_FILENO, "Test task\r\n", strlen( "Test task\r\n" ) );
//     }
// }

/*-----------------------------------------------------------*/

static void prvROAccessTask( void * pvParameters )
{
    /* Unused parameters. */
    ( void ) pvParameters;

	// if (portIS_PRIVILEGED() == 1) {
	// 	// printf("ROAccess task is running in priveleged mode\r\n");
	// 	printf("ROAccess\r\n");
	// } else {
	// 	printf("ROAccess task\r\n");
	// // 	printf("ROAccess task is running in unpriveleged mode\r\n");
	// }

	ucSharedMemory[ 0 ] = 1;
        
    for( ; ; )
    {
        /* Wait for a 3 seconds. */
        vTaskDelay( pdMS_TO_TICKS( 3 * 1000 ) );
		// vTaskDelete(NULL);
    }
}
/*-----------------------------------------------------------*/

static void prvRWAccessTask( void * pvParameters )
{
    /* Unused parameters. */
    ( void ) pvParameters;

	if (portIS_PRIVILEGED() == 1) {
		// write( STDOUT_FILENO, "RWAccess\r\n", strlen("RWAccess\r\n") );
		// printf("RWAccess task is running in priveleged mode\r\n");
		// printf("RWAccess\r\n");
	} else {
		// write( STDOUT_FILENO, "RWAccess\r\n", strlen("RWAccess\r\n") );
		// printf("RWAccess\r\n");
	// 	printf("RWAccess task is running in unpriveleged mode\r\n");
	}

	// printf("[ RWAccess ] : ucSharedMemory[0] = %d\r\n", ucSharedMemory[0]);
	// ucSharedMemory[0] = 1;
	// printf("[ RWAccess ] : ucSharedMemory[0] = %d\r\n", ucSharedMemory[0]);
	// metal_tty_putc( '#' );

    for( ; ; )
    {
        /* This task has RW access to ucSharedMemory and therefore can write to
         * it. */
        // ucSharedMemory[ 0 ] = 0;

        /* Wait for a 3 seconds. */
        vTaskDelay( pdMS_TO_TICKS( 3 * 1000 ) );
		// vTaskDelete(NULL);
    }
}
/*-----------------------------------------------------------*/

