Samsung/mTower/arch/riscv32/bl808/src/pine64_ox64/nonsecure/main.c
// /**
//  * @brief         clnSrvTask - cleaning service.
//  *
//  * @param         None
//  *
//  * @returns       None
//  */
// static void clnSrvTask( void *pvParameters )
// {
//   const TickType_t xDelay = 1000 / portTICK_PERIOD_MS;

//   (void)pvParameters;

//   do {
//     vTaskPrioritySet( xTaskGetIdleTaskHandle(), uxTaskPriorityGet(xTaskGetCurrentTaskHandle()));
// //    taskYIELD();
//     vTaskDelay( xDelay );
//     vTaskPrioritySet( xTaskGetIdleTaskHandle(), tskIDLE_PRIORITY);
//     vTaskDelay( xDelay );
//   } while (1);
// }

#define BUFFER_SIZE 300

/**
 * @brief         menuTask1 - .
 *
 * @param         None
 *
 * @returns       None
 */
static void menuTask(void *pvParameters) PRIVILEGED_FUNCTION
{
  /* Define a buffer that is large enough to hold the generated table.  In most
   * cases the buffer will be too large to allocate on the stack, hence in this
   * example it is declared static. */

  static char cBuffer[BUFFER_SIZE];
  extern uint32_t __unprivileged_data_section_start__[];
  extern uint32_t __unprivileged_data_section_end__[];
  TaskHandle_t xHandle_TaskROAccess = NULL, xHandle_TaskRWAccess = NULL, xHandle_ReceiveTask = NULL, xHandle_SendTask = NULL;

		static TaskParameters_t xROAccessTaskParameters =
		{
			.pvTaskCode = prvROAccessTask,
			.pcName = "ROAccess",
			.usStackDepth = 128, //configMINIMAL_STACK_SIZE,
			.pvParameters = NULL,
			.uxPriority = mainQUEUE_SEND_TASK_PRIORITY,
			.puxStackBuffer = NULL,
			// .puxStackBuffer = xROAccessTaskStack,
		};

	    static TaskParameters_t xRWAccessTaskParameters =
    	{
        	.pvTaskCode     = prvRWAccessTask,
        	.pcName         = "RWAccess",
        	.usStackDepth   = 128, //configMINIMAL_STACK_SIZE,
        	.pvParameters   = NULL, 
        	.uxPriority     = mainQUEUE_SEND_TASK_PRIORITY,
			.puxStackBuffer = NULL,
        	// .puxStackBuffer = xRWAccessTaskStack,
		};
		static TaskParameters_t xTaskRXDefinition =
		{
			.pvTaskCode = prvQueueReceiveTask,
			.pcName = "Rx",
			.usStackDepth = configMINIMAL_STACK_SIZE,
			.pvParameters = NULL,
			.uxPriority = mainQUEUE_RECEIVE_TASK_PRIORITY,
			.puxStackBuffer = NULL,
		};
		static TaskParameters_t xTaskTXDefinition =
		{
			.pvTaskCode = prvQueueSendTask,
			.pcName = "Tx",
			.usStackDepth = configMINIMAL_STACK_SIZE,
			.pvParameters = NULL,
			.uxPriority = mainQUEUE_SEND_TASK_PRIORITY,
			.puxStackBuffer = NULL,
		};



  (void)pvParameters;

  int ch;
  do
  {
	// portDISABLE_INTERRUPTS();
	printf("\n+- Menu -----------------------------------------------------+\r\n");
#ifdef CONFIG_APPS_HELLO_WORLD
	printf("| [1] - Run 2 unprvl apps & demo interaction between themem  |\r\n");
	printf("| [2] - Delete 2 unprvl apps                                 |\r\n");
#endif
#ifdef CONFIG_APPS_HOTP
    printf("| [3] - Run HOTP (Ported from OP-TEE, user TA)               |\r\n");
#endif
    printf("| [4] - Get FreeRTOS Task List                               |\r\n");
#ifdef CONFIG_APPS_TEST
    printf("| [5] - Run Test Suite for GP TEE Client & Internal API      |\r\n");
#endif
#ifdef CONFIG_APPS_HW_SECURITY_EXCEPTION_EXAMPLE
    printf("| [6] - Run H/W Security exception example (from non-secure) |\r\n");
    printf("| [7] - Run H/W Security exception example (from secure)     |\r\n");
#endif
#ifdef CONFIG_APPS_SPY
    printf("| [8] - Run test & spy (trying to get protected data) unprvl |\r\n");
    printf("| [9] - Delete test & spy unprvl apps                        |\r\n");
#endif
    printf("+------------------------------------------------------------+\r\n");

	// portENABLE_INTERRUPTS();
    while (1) {
        ch = bflb_uart_getchar(uart0);
        if (ch == -1) {
            taskYIELD();
            // vTaskDelay(mainQUEUE_TICK_COUNT_FOR_1S);
        } else break;
    }
    printf("\n[%c]\r\n", (char) ch);

    switch (ch) {
#ifdef CONFIG_APPS_HELLO_WORLD
    case '1':
	xQueue = xQueueCreate( mainQUEUE_LENGTH, sizeof( uint32_t ) );

	if( xQueue != NULL )
	{
		extern uint32_t __unprivileged_data_section_start__[];
		extern uint32_t __unprivileged_data_section_end__[];

				/* 
		 * Prepare xRegions for Receive Task 
		 */
        memset(&xTaskRXDefinition.xRegions, 0, sizeof(xTaskRXDefinition.xRegions));

        // authorize access to data and bss
		// 		Low address 
        xTaskRXDefinition.xRegions[0].ulLengthInBytes = 4;
        xTaskRXDefinition.xRegions[0].ulParameters = ((portPMP_REGION_READ_WRITE) |
                                                    (portPMP_REGION_ADDR_MATCH_NA4));
        // addr_modifier ( xPmpInfo.granularity,
        //                 ( size_t ) __unprivileged_data_section_start__,
        //                 (size_t *) &xTaskRXDefinition.xRegions[0].pvBaseAddress);
		// printf("xTaskRXDefinition.xRegions[0].pvBaseAddress = %p\r\n", xTaskRXDefinition.xRegions[0].pvBaseAddress);
		// 		High address 
        xTaskRXDefinition.xRegions[1].ulLengthInBytes = 4;
        xTaskRXDefinition.xRegions[1].ulParameters = ((portPMP_REGION_READ_WRITE) |
                                                    (portPMP_REGION_ADDR_MATCH_TOR));

//         addr_modifier ( xPmpInfo.granularity,
//                         ( size_t ) __unprivileged_data_section_end__,
//                         (size_t *) &xTaskRXDefinition.xRegions[1].pvBaseAddress);
// 		// printf("xTaskRXDefinition.xRegions[1].pvBaseAddress = %p\r\n", xTaskRXDefinition.xRegions[1].pvBaseAddress);

#ifdef METAL_SIFIVE_UART0
    // allow access to UART peripheral
        xTaskRXDefinition.xRegions[2].ulLengthInBytes = METAL_SIFIVE_UART0_0_SIZE;
        xTaskRXDefinition.xRegions[2].ulParameters = ((portPMP_REGION_READ_WRITE) |
                                                     (portPMP_REGION_ADDR_MATCH_NAPOT));

//         napot_addr_modifier (	xPmpInfo.granularity,
//                                 (size_t) METAL_SIFIVE_UART0_0_BASE_ADDRESS,
//                                 (size_t *) &xTaskRXDefinition.xRegions[2].pvBaseAddress,
//                                 xTaskRXDefinition.xRegions[2].ulLengthInBytes);
#endif /* METAL_SIFIVE_UART0 */

        // allocate stack (It will take 2 PMP Slot - So it is not needed to put align the StackBuffer)
        xTaskRXDefinition.puxStackBuffer = ( StackType_t * ) pvPortMalloc( xTaskRXDefinition.usStackDepth * sizeof( StackType_t ) );
        // xTaskRXDefinition.puxStackBuffer = xReceiveTaskStack;
		// portDISABLE_INTERRUPTS();
		// printf("xTaskRXDefinition.puxStackBuffer = %p\r\n", xTaskRXDefinition.puxStackBuffer);
		// portENABLE_INTERRUPTS();
        xTaskCreateRestricted(  &xTaskRXDefinition,
                                &xHandle_ReceiveTask);

