Samsung/mTower/arch/riscv32/bl808/src/pine64_ox64/nonsecure/main.c
		/*
		 * Prepare xRegions for Send Task 
		 */
        memset(&xTaskTXDefinition.xRegions, 0, sizeof(xTaskTXDefinition.xRegions));

        // authorize access to data and bss
		// 		Low address 
        xTaskTXDefinition.xRegions[0].ulLengthInBytes = 4;
        xTaskTXDefinition.xRegions[0].ulParameters = ((portPMP_REGION_READ_WRITE) |
                                                    (portPMP_REGION_ADDR_MATCH_NA4));
//        addr_modifier ( xPmpInfo.granularity,
//                        ( size_t ) __unprivileged_data_section_start__,
//                        (size_t *) &xTaskTXDefinition.xRegions[0].pvBaseAddress);

		// 		High address 
        xTaskTXDefinition.xRegions[1].ulLengthInBytes = 4;
        xTaskTXDefinition.xRegions[1].ulParameters = ((portPMP_REGION_READ_WRITE) |
                                                    (portPMP_REGION_ADDR_MATCH_TOR));

//         addr_modifier ( xPmpInfo.granularity,
//                         ( size_t ) __unprivileged_data_section_end__,
//                         (size_t *) &xTaskTXDefinition.xRegions[1].pvBaseAddress);

// #ifdef METAL_SIFIVE_GPIO0
//         // allow access to GPIO (Each peripheral are on 4Kb mapping area)
//         xTaskTXDefinition.xRegions[2].ulLengthInBytes = METAL_SIFIVE_GPIO0_0_SIZE;
//         xTaskTXDefinition.xRegions[2].ulParameters = ((portPMP_REGION_READ_WRITE) |
//                                                      (portPMP_REGION_ADDR_MATCH_NAPOT));

//         napot_addr_modifier (	xPmpInfo.granularity,
//                                 (size_t) METAL_SIFIVE_GPIO0_0_BASE_ADDRESS,
//                                 (size_t *) &xTaskTXDefinition.xRegions[2].pvBaseAddress,
//                                 xTaskTXDefinition.xRegions[2].ulLengthInBytes);
// #endif /* METAL_SIFIVE_GPIO0 */

#ifdef METAL_SIFIVE_UART0
    // allow access to UART peripheral
        xTaskTXDefinition.xRegions[2].ulLengthInBytes = METAL_SIFIVE_UART0_0_SIZE;
        xTaskTXDefinition.xRegions[2].ulParameters = ((portPMP_REGION_READ_WRITE) |
                                                     (portPMP_REGION_ADDR_MATCH_NAPOT));

//        napot_addr_modifier (	xPmpInfo.granularity,
//                                (size_t) METAL_SIFIVE_UART0_0_BASE_ADDRESS,
//                                (size_t *) &xTaskTXDefinition.xRegions[2].pvBaseAddress,
//                                xTaskTXDefinition.xRegions[2].ulLengthInBytes);
#endif /* METAL_SIFIVE_UART0 */
        // allocate stack (It will take 2 PMP Slot - So it is not needed to put align the StackBuffer)
        xTaskTXDefinition.puxStackBuffer = ( StackType_t * ) pvPortMalloc( xTaskTXDefinition.usStackDepth * sizeof( StackType_t ) );
        // xTaskTXDefinition.puxStackBuffer = xSendTaskStack;

		// printf("xTaskTXDefinition.puxStackBuffer = %p\r\n", xTaskTXDefinition.puxStackBuffer);

        xTaskCreateRestricted(  &xTaskTXDefinition,
                                &xHandle_SendTask);

	}

        break;
		case '2':
			if (xHandle_ReceiveTask != NULL)
				vTaskDelete(xHandle_ReceiveTask);
			if (xHandle_SendTask != NULL)
				vTaskDelete(xHandle_SendTask);
			if (xTaskRXDefinition.puxStackBuffer != NULL)
				vPortFree(xTaskRXDefinition.puxStackBuffer);
			if (xTaskTXDefinition.puxStackBuffer != NULL)
				vPortFree(xTaskTXDefinition.puxStackBuffer);
 		break;
#endif
      case '4':
        /* Obtain the current tick count. */
        printf("\nAuto-reload timer callback executing = %d\r\n", xTaskGetTickCount());

        /* Pass the buffer into vTaskList() to generate the table of information. */
        vTaskList(cBuffer);
        portDISABLE_INTERRUPTS();
        printf("%s\n", cBuffer);
        portENABLE_INTERRUPTS();
        break;
#ifdef CONFIG_APPS_SPY
        case '8':
		/* 
		 * Prepare xRegions for xROAccess Task 
		 */
        memset(&xROAccessTaskParameters.xRegions, 0, sizeof(xROAccessTaskParameters.xRegions));

        // authorize access to data and bss
				// Low address 
        xROAccessTaskParameters.xRegions[0].ulLengthInBytes = 4;
        xROAccessTaskParameters.xRegions[0].ulParameters = ((portPMP_REGION_READ_ONLY) |
                                                    (portPMP_REGION_ADDR_MATCH_NA4));
//        addr_modifier ( xPmpInfo.granularity,
//                        // ( size_t ) __unprivileged_data_section_start__,
//						( size_t ) ucSharedMemory,
//                        (size_t *) &xROAccessTaskParameters.xRegions[0].pvBaseAddress);
		// printf("xROAccessTaskParameters.xRegions[0].pvBaseAddress = %p\r\n", xROAccessTaskParameters.xRegions[0].ulLengthInBytes);

				// High address 
        xROAccessTaskParameters.xRegions[1].ulLengthInBytes = 4;
        xROAccessTaskParameters.xRegions[1].ulParameters = ((portPMP_REGION_READ_WRITE) |
                                                    (portPMP_REGION_ADDR_MATCH_TOR));

//         addr_modifier ( xPmpInfo.granularity,
//                         ( size_t ) __unprivileged_data_section_end__,
//                         (size_t *) &xROAccessTaskParameters.xRegions[1].pvBaseAddress);

#ifdef METAL_SIFIVE_UART0
    // allow access to UART peripheral
        xROAccessTaskParameters.xRegions[2].ulLengthInBytes = METAL_SIFIVE_UART0_0_SIZE;
        xROAccessTaskParameters.xRegions[2].ulParameters = ((portPMP_REGION_READ_WRITE) |
                                                     (portPMP_REGION_ADDR_MATCH_NAPOT));

//         napot_addr_modifier (	xPmpInfo.granularity,
//                                 (size_t) METAL_SIFIVE_UART0_0_BASE_ADDRESS,
//                                 (size_t *) &xROAccessTaskParameters.xRegions[2].pvBaseAddress,
//                                 xROAccessTaskParameters.xRegions[2].ulLengthInBytes);
#endif /* METAL_SIFIVE_UART0 */

        xROAccessTaskParameters.puxStackBuffer = ( StackType_t * ) pvPortMalloc( xROAccessTaskParameters.usStackDepth * sizeof( StackType_t ) );
        // xROAccessTaskParameters.puxStackBuffer = xROAccessTaskStack;
		// printf("xROAccessTaskParameters.puxStackBuffer = %p\r\n", xROAccessTaskParameters.puxStackBuffer);


        xTaskCreateRestricted(  &xROAccessTaskParameters,
                                &xHandle_TaskROAccess);

