Samsung/mTower/arch/riscv32/bl808/src/pine64_ox64/nonsecure/main.c
		/* 
		 * Prepare xRegions for xRWAccess Task 
		 */
        memset(&xRWAccessTaskParameters.xRegions, 0, sizeof(xRWAccessTaskParameters.xRegions));

        // authorize access to data and bss
				// Low address 
		// printf("xROAccessTaskParameters.xRegions[0].ulLengthInBytes = %d\r\n", xROAccessTaskParameters.xRegions[0].ulLengthInBytes);
        xRWAccessTaskParameters.xRegions[0].ulLengthInBytes = 4;
        xRWAccessTaskParameters.xRegions[0].ulParameters = ((portPMP_REGION_READ_WRITE) |
                                                    (portPMP_REGION_ADDR_MATCH_NA4));
//         addr_modifier ( xPmpInfo.granularity,
//                         // ( size_t ) __unprivileged_data_section_start__,
// 						( size_t ) ucSharedMemory,
//                         (size_t *) &xRWAccessTaskParameters.xRegions[0].pvBaseAddress);

		// printf("xRWAccessTaskParameters.xRegions[0].pvBaseAddress = %p\r\n", xRWAccessTaskParameters.xRegions[0].pvBaseAddress);
				// High address 
        xRWAccessTaskParameters.xRegions[1].ulLengthInBytes = 4;
        xRWAccessTaskParameters.xRegions[1].ulParameters = ((portPMP_REGION_READ_WRITE) |
                                                    (portPMP_REGION_ADDR_MATCH_TOR));

//         addr_modifier ( xPmpInfo.granularity,
//                         ( size_t ) __unprivileged_data_section_end__,
//                         (size_t *) &xRWAccessTaskParameters.xRegions[1].pvBaseAddress);

#ifdef METAL_SIFIVE_UART0
    // allow access to UART peripheral
        xRWAccessTaskParameters.xRegions[2].ulLengthInBytes = METAL_SIFIVE_UART0_0_SIZE;
        xRWAccessTaskParameters.xRegions[2].ulParameters = ((portPMP_REGION_READ_WRITE) |
                                                     (portPMP_REGION_ADDR_MATCH_NAPOT));

//         napot_addr_modifier (	xPmpInfo.granularity,
//                                 (size_t) METAL_SIFIVE_UART0_0_BASE_ADDRESS,
//                                 (size_t *) &xRWAccessTaskParameters.xRegions[2].pvBaseAddress,
//                                 xRWAccessTaskParameters.xRegions[2].ulLengthInBytes);
#endif /* METAL_SIFIVE_UART0 */

        xRWAccessTaskParameters.puxStackBuffer = ( StackType_t * ) pvPortMalloc( xRWAccessTaskParameters.usStackDepth * sizeof( StackType_t ) );
        // xRWAccessTaskParameters.puxStackBuffer = xRWAccessTaskStack;
		// printf("xRWAccessTaskParameters.puxStackBuffer = %p\r\n", xRWAccessTaskParameters.puxStackBuffer);

        xTaskCreateRestricted(  &xRWAccessTaskParameters,
                                &xHandle_TaskRWAccess);

        // spyAppTask();
        break;
		case '9':
			if (xHandle_TaskROAccess != NULL)
				vTaskDelete(xHandle_TaskROAccess);
			if (xHandle_TaskRWAccess != NULL)
				vTaskDelete(xHandle_TaskRWAccess);
			if (xROAccessTaskParameters.puxStackBuffer != NULL)
				vPortFree(xROAccessTaskParameters.puxStackBuffer);
			if (xRWAccessTaskParameters.puxStackBuffer != NULL)
				vPortFree(xRWAccessTaskParameters.puxStackBuffer);
 		break;
#endif
      default:
        break;
    }
    taskYIELD();
		vTaskDelay(mainQUEUE_TICK_COUNT_FOR_1S);

  } while (1);
}


// static void ledBlinkTask( void *pvParameters ) PRIVILEGED_FUNCTION
// {
// 	unsigned long ulCounter = 0;

// 	/* Remove compiler warning about unused parameter. */
// 	( void ) pvParameters;

// 	struct metal_gpio *led0; //make instance of GPIO

//   //Get gpio device handle, i.e.) define IC pin here where IC's GPIO = 5, pin silkscreen = 13
//   //this is the GPIO device index that is referenced from 0, make sure to check the schematic
//   led0 = metal_gpio_get_device(0);

//   //Pins are set when initialized so we must disable it when we use it as an input/output
//   metal_gpio_disable_input(led0, 5);

//   //Set as gpio as output
//   metal_gpio_enable_output(led0, 5);

//   //Pins have more than one function, make sure we disconnect anything connected...
//   metal_gpio_disable_pinmux(led0, 5);

//   //Turn ON pin
//   metal_gpio_set_pin(led0, 5, 1);

// 	for( ;; )
// 	{
//         metal_gpio_set_pin(led0, 5, ++ulCounter&0x01);
// 		vTaskDelay(mainQUEUE_TICK_COUNT_FOR_1S);

// 	}
// }

// void print_stack_pointer() {
//   void* p = NULL;
//   printf("%p\n", (void*)&p);
// }
/*-----------------------------------------------------------*/

int main( void )
{
	xPortFreeRTOSInit();
	// TaskHandle_t xHandle_ReceiveTask, xHandle_SendTask, xHandle_TaskListTasks, xHandle_TaskROAccess, xHandle_TaskRWAccess;

    // static StackType_t xTaskListTasksShowStack[ configMINIMAL_STACK_SIZE * 3] __attribute__( ( aligned( 32 ) ) ); 
    // static StackType_t xSendTaskStack[ configMINIMAL_STACK_SIZE ] __attribute__( ( aligned( 32 ) ) );
    // static StackType_t xReceiveTaskStack[ configMINIMAL_STACK_SIZE ] __attribute__( ( aligned( 32 ) ) );
    // static StackType_t xROAccessTaskStack[ configMINIMAL_STACK_SIZE ] __attribute__( ( aligned( 32 ) ) );
    // static StackType_t xRWAccessTaskStack[ configMINIMAL_STACK_SIZE ] __attribute__( ( aligned( 32 ) ) );


	// const char * const pcMessage = "FreeRTOS-TEE Demo start\r\n";
	// const char * const pcMessageEnd = "FreeRTOS-TEE Demo end\r\n";
	// const char * const pcMessageEndError = "FreeRTOS-TEE Demo end - Error no enough PMP entry\r\n";
    // const char * const pcMessageGranularityError = "FreeRTOS-TEE Demo end - Error platform granularity no supported\r\n";

	// extern uint32_t __unprivileged_data_section_start__[];
	// extern uint32_t __unprivileged_data_section_end__[];
	// extern uint32_t __heap_start[];
	// extern uint32_t __heap_end[];
	// extern unsigned long __privileged_data_start__[];
	// extern unsigned long __privileged_data_end__[];
	// extern unsigned long __privileged_functions_start__[];
	// extern unsigned long __privileged_functions_end__[];
	// extern unsigned long metal_segment_stack_begin[];
	// extern unsigned long metal_segment_stack_end[];
	// volatile unsigned long *pul;

	prvSetupHardware();

	// printf("\n\n\t-=mTower v" VERSION "=-  " __DATE__ "  " __TIME__"\n\n");
	printf("\n\n\t-=mTower v0.5.0"  "=-  " __DATE__ "  " __TIME__"\r\n\n");

