Samsung/mTower/arch/riscv32/bl808/src/pine64_ox64/nonsecure/main.c
	// printf("__ricsv_xlen = %d\r\n", __riscv_xlen);

	// pul = __unprivileged_data_section_start__;
	// printf("__unprivileged_data_section_start__ = %p\r\n", pul);

	// pul = __unprivileged_data_section_end__;
	// printf("__unprivileged_data_section_end__ = %p\r\n", pul);

	// pul = __privileged_data_start__;
	// printf("__privileged_data_start__ = %p\r\n", pul);

	// pul = __privileged_data_end__;
	// printf("__privileged_data_end__ = %p\r\n", pul);

	// pul = metal_segment_stack_begin;
	// printf("metal_segment_stack_begin = %p\r\n", pul);

	// pul = metal_segment_stack_end;
	// printf("metal_segment_stack_end = %p\r\n", pul);

	// pul = __heap_start;
	// printf("__heap_start = %p\r\n", pul);

	// pul = __heap_end;
	// printf("__heap_end = %p\r\n", pul);

	// pul = __privileged_functions_start__;
	// printf("__privileged_functions_start__ = %p\r\n", pul);

	// pul = __privileged_functions_end__;
	// printf("__privileged_functions_end__ = %p\r\n", pul);

	// printf("sizeof( StackType_t ) = %d\r\n", sizeof( StackType_t ));
	// printf("portTOTAL_NUM_CFG_REG = %d\r\n", portTOTAL_NUM_CFG_REG);

	// write( STDOUT_FILENO, pcMessage, strlen( pcMessage ) );
	// BaseType_t xReturned;
	// TaskHandle_t xHandle = NULL;

	// char *buf = pvPortMalloc(8);
	// if (buf != NULL) {
	// 	printf("pvPortMalloc: *buf = %p\r\n", buf);
	// }

	// xReturned = xTaskCreate(
    //                 vTaskCode,       /* Function that implements the task. */
    //                 "PRVLGD",          /* Text name for the task. */
    //                 512,      /* Stack size in words, not bytes. */
    //                 NULL, //( void * ) 1,    /* Parameter passed into the task. */
    //                 mainQUEUE_SEND_TASK_PRIORITY | portPRIVILEGE_BIT,/* Priority at which the task is created. */
    //                 &xHandle );      /* Used to pass out the created task's handle. */

	xTaskCreate(menuTask,			  /* The function that implements the task. */
				"menu",				  /* The text name assigned to the task - for debug only as it is not used by the kernel. */
				768,				  /* The size of the stack to allocate to the task. */
				(void *)NULL,		  /* The parameter passed to the task - just to check the functionality. */
				mainQUEUE_SEND_TASK_PRIORITY | portPRIVILEGE_BIT, /* The priority assigned to the task. */
				NULL);

	// xTaskCreate(ledBlinkTask,	  /* The function that implements the task. */
	// 			"ledBlink",		  /* The text name assigned to the task - for debug only as it is not used by the kernel. */
	// 			128,				  /* The size of the stack to allocate to the task. */
	// 			(void *)NULL,		  /* The parameter passed to the task - just to check the functionality. */
	// 			mainQUEUE_SEND_TASK_PRIORITY | portPRIVILEGE_BIT, /* The priority assigned to the task. */
	// 			NULL);

// #if( portUSING_MPU_WRAPPERS == 1 )
// 	if (xPmpInfo.nb_pmp < 8)
// 	{
// 		write( STDOUT_FILENO, pcMessageEndError, strlen( pcMessageEndError ) );
// 		_exit(0);
// 	} else if (xPmpInfo.granularity > 4) {
//         /* 
//          * platfrom granularity > 4 bytes is not supported yet, some
//          * modifications are needed on FreeRTOS port to do so.
//          */
//         write( STDOUT_FILENO, pcMessageGranularityError, strlen( pcMessageGranularityError ) );
// 		_exit(0);
//     }

	// printf("xPmpInfo.nb_pmp = %d\r\n", xPmpInfo.nb_pmp);

	/* Create the queue. */
	// xQueue = xQueueCreate( mainQUEUE_LENGTH, sizeof( uint32_t ) );

	// if( xQueue != NULL )
	// {
	// 	extern uint32_t __unprivileged_data_section_start__[];
	// 	extern uint32_t __unprivileged_data_section_end__[];

		// static TaskParameters_t xTaskListTasksShowDefinition =
		// {
		// 	.pvTaskCode = prvListTasksShowTask,
		// 	.pcName = "UNPRVLGD",
		// 	.usStackDepth = 224, //configMINIMAL_STACK_SIZE,
		// 	.pvParameters = NULL,
		// 	.uxPriority = mainQUEUE_RECEIVE_TASK_PRIORITY,
		// 	.puxStackBuffer = NULL,
		// };

		// static TaskParameters_t xTaskRXDefinition =
		// {
		// 	.pvTaskCode = prvQueueReceiveTask,
		// 	.pcName = "Rx",
		// 	.usStackDepth = configMINIMAL_STACK_SIZE,
		// 	.pvParameters = NULL,
		// 	.uxPriority = mainQUEUE_RECEIVE_TASK_PRIORITY,
		// 	.puxStackBuffer = NULL,
		// };

		// static TaskParameters_t xTaskTXDefinition =
		// {
		// 	.pvTaskCode = prvQueueSendTask,
		// 	.pcName = "Tx",
		// 	.usStackDepth = configMINIMAL_STACK_SIZE,
		// 	.pvParameters = NULL,
		// 	.uxPriority = mainQUEUE_SEND_TASK_PRIORITY,
		// 	.puxStackBuffer = NULL,
		// };

		// static TaskParameters_t xROAccessTaskParameters =
		// {
		// 	.pvTaskCode = prvROAccessTask,
		// 	.pcName = "ROAccess",
		// 	.usStackDepth = 224, //configMINIMAL_STACK_SIZE,
		// 	.pvParameters = NULL,
		// 	.uxPriority = mainQUEUE_SEND_TASK_PRIORITY,
		// 	.puxStackBuffer = NULL,
		// 	// .puxStackBuffer = xROAccessTaskStack,
		// };

	    // static TaskParameters_t xRWAccessTaskParameters =
    	// {
        // 	.pvTaskCode     = prvRWAccessTask,
        // 	.pcName         = "RWAccess",
        // 	.usStackDepth   = 128, //configMINIMAL_STACK_SIZE,
        // 	.pvParameters   = NULL, 
        // 	.uxPriority     = mainQUEUE_SEND_TASK_PRIORITY,
		// 	.puxStackBuffer = NULL,
        // 	// .puxStackBuffer = xRWAccessTaskStack,
		// };

		// printf("xROAccessTaskParameters.pcName = %s\r\n", xROAccessTaskParameters.pcName);
		// printf("xTaskTXDefinition.pcName = %s\r\n", xTaskTXDefinition.pcName);

        // if(0 == xPmpInfo.granularity) 
		// {
		//     init_pmp (&xPmpInfo);
        // }
		// printf("xPmpInfo.granularity = %d\r\n", xPmpInfo.granularity);
// 		/* 
// 		 * Prepare xRegions for Receive Task 
// 		 */
//         memset(&xTaskRXDefinition.xRegions, 0, sizeof(xTaskRXDefinition.xRegions));

//         // authorize access to data and bss
// 		// 		Low address 
//         xTaskRXDefinition.xRegions[0].ulLengthInBytes = 4;
//         xTaskRXDefinition.xRegions[0].ulParameters = ((portPMP_REGION_READ_WRITE) |
//                                                     (portPMP_REGION_ADDR_MATCH_NA4));
//         addr_modifier ( xPmpInfo.granularity,
//                         ( size_t ) __unprivileged_data_section_start__,
//                         (size_t *) &xTaskRXDefinition.xRegions[0].pvBaseAddress);
// 		// printf("xTaskRXDefinition.xRegions[0].pvBaseAddress = %p\r\n", xTaskRXDefinition.xRegions[0].pvBaseAddress);
// 		// 		High address 
//         xTaskRXDefinition.xRegions[1].ulLengthInBytes = 4;
//         xTaskRXDefinition.xRegions[1].ulParameters = ((portPMP_REGION_READ_WRITE) |
//                                                     (portPMP_REGION_ADDR_MATCH_TOR));

//         addr_modifier ( xPmpInfo.granularity,
//                         ( size_t ) __unprivileged_data_section_end__,
//                         (size_t *) &xTaskRXDefinition.xRegions[1].pvBaseAddress);
// 		// printf("xTaskRXDefinition.xRegions[1].pvBaseAddress = %p\r\n", xTaskRXDefinition.xRegions[1].pvBaseAddress);

// #ifdef METAL_SIFIVE_UART0
//     // allow access to UART peripheral
//         xTaskRXDefinition.xRegions[2].ulLengthInBytes = METAL_SIFIVE_UART0_0_SIZE;
//         xTaskRXDefinition.xRegions[2].ulParameters = ((portPMP_REGION_READ_WRITE) |
//                                                      (portPMP_REGION_ADDR_MATCH_NAPOT));

