Samsung/mTower/arch/riscv32/bl808/src/pine64_ox64/nonsecure/main.c
//         napot_addr_modifier (	xPmpInfo.granularity,
//                                 (size_t) METAL_SIFIVE_UART0_0_BASE_ADDRESS,
//                                 (size_t *) &xTaskRXDefinition.xRegions[2].pvBaseAddress,
//                                 xTaskRXDefinition.xRegions[2].ulLengthInBytes);
// #endif /* METAL_SIFIVE_UART0 */

//         // allocate stack (It will take 2 PMP Slot - So it is not needed to put align the StackBuffer)
//         xTaskRXDefinition.puxStackBuffer = ( StackType_t * ) pvPortMalloc( xTaskRXDefinition.usStackDepth * sizeof( StackType_t ) );
//         // xTaskRXDefinition.puxStackBuffer = xReceiveTaskStack;
// 		// portDISABLE_INTERRUPTS();
// 		printf("xTaskRXDefinition.puxStackBuffer = %p\r\n", xTaskRXDefinition.puxStackBuffer);
// 		// portENABLE_INTERRUPTS();
//         xTaskCreateRestricted(  &xTaskRXDefinition,
//                                 &xHandle_ReceiveTask);

// 		/*
// 		 * Prepare xRegions for Send Task 
// 		 */
//         memset(&xTaskTXDefinition.xRegions, 0, sizeof(xTaskTXDefinition.xRegions));

//         // authorize access to data and bss
// 		// 		Low address 
//         xTaskTXDefinition.xRegions[0].ulLengthInBytes = 4;
//         xTaskTXDefinition.xRegions[0].ulParameters = ((portPMP_REGION_READ_WRITE) |
//                                                     (portPMP_REGION_ADDR_MATCH_NA4));
//         addr_modifier ( xPmpInfo.granularity,
//                         ( size_t ) __unprivileged_data_section_start__,
//                         (size_t *) &xTaskTXDefinition.xRegions[0].pvBaseAddress);

// 		// 		High address 
//         xTaskTXDefinition.xRegions[1].ulLengthInBytes = 4;
//         xTaskTXDefinition.xRegions[1].ulParameters = ((portPMP_REGION_READ_WRITE) |
//                                                     (portPMP_REGION_ADDR_MATCH_TOR));

//         addr_modifier ( xPmpInfo.granularity,
//                         ( size_t ) __unprivileged_data_section_end__,
//                         (size_t *) &xTaskTXDefinition.xRegions[1].pvBaseAddress);

// #ifdef METAL_SIFIVE_GPIO0
//         // allow access to GPIO (Each peripheral are on 4Kb mapping area)
//         xTaskTXDefinition.xRegions[2].ulLengthInBytes = METAL_SIFIVE_GPIO0_0_SIZE;
//         xTaskTXDefinition.xRegions[2].ulParameters = ((portPMP_REGION_READ_WRITE) |
//                                                      (portPMP_REGION_ADDR_MATCH_NAPOT));

//         napot_addr_modifier (	xPmpInfo.granularity,
//                                 (size_t) METAL_SIFIVE_GPIO0_0_BASE_ADDRESS,
//                                 (size_t *) &xTaskTXDefinition.xRegions[2].pvBaseAddress,
//                                 xTaskTXDefinition.xRegions[2].ulLengthInBytes);
// #endif /* METAL_SIFIVE_GPIO0 */

// // #ifdef METAL_SIFIVE_UART0
// //     // allow access to UART peripheral
// //         xTaskTXDefinition.xRegions[2].ulLengthInBytes = METAL_SIFIVE_UART0_0_SIZE;
// //         xTaskTXDefinition.xRegions[2].ulParameters = ((portPMP_REGION_READ_WRITE) |
// //                                                      (portPMP_REGION_ADDR_MATCH_NAPOT));

// //         napot_addr_modifier (	xPmpInfo.granularity,
// //                                 (size_t) METAL_SIFIVE_UART0_0_BASE_ADDRESS,
// //                                 (size_t *) &xTaskTXDefinition.xRegions[2].pvBaseAddress,
// //                                 xTaskTXDefinition.xRegions[2].ulLengthInBytes);
// // #endif /* METAL_SIFIVE_UART0 */
//         // allocate stack (It will take 2 PMP Slot - So it is not needed to put align the StackBuffer)
//         xTaskTXDefinition.puxStackBuffer = ( StackType_t * ) pvPortMalloc( xTaskTXDefinition.usStackDepth * sizeof( StackType_t ) );
//         // xTaskTXDefinition.puxStackBuffer = xSendTaskStack;

// 		printf("xTaskTXDefinition.puxStackBuffer = %p\r\n", xTaskTXDefinition.puxStackBuffer);

//         xTaskCreateRestricted(  &xTaskTXDefinition,
//                                 &xHandle_SendTask);

		/* 
		 * Prepare xRegions for ListTasksShow Task 
		 */
//         memset(&xTaskListTasksShowDefinition.xRegions, 0, sizeof(xTaskListTasksShowDefinition.xRegions));

// 		xTaskListTasksShowDefinition.puxStackBuffer = ( StackType_t * ) pvPortMalloc( xTaskListTasksShowDefinition.usStackDepth * sizeof( StackType_t ) );

//         // xTaskListTasksShowDefinition.puxStackBuffer = xTaskListTasksShowStack;

//         xTaskListTasksShowDefinition.xRegions[0].ulLengthInBytes = xTaskListTasksShowDefinition.usStackDepth * sizeof( StackType_t );
//         xTaskListTasksShowDefinition.xRegions[0].ulParameters = ((portPMP_REGION_READ_WRITE) |
//                                                      (portPMP_REGION_ADDR_MATCH_NAPOT));

//         napot_addr_modifier (	xPmpInfo.granularity,
//                                 (size_t) xTaskListTasksShowDefinition.puxStackBuffer,
//                                 (size_t *) &xTaskListTasksShowDefinition.xRegions[0].pvBaseAddress,
//                                 xTaskListTasksShowDefinition.xRegions[0].ulLengthInBytes);


//         // authorize access to data and bss
// 				// Low address 
//         // xTaskListTasksShowDefinition.xRegions[0].ulLengthInBytes = 4;
//         // xTaskListTasksShowDefinition.xRegions[0].ulParameters = ((portPMP_REGION_READ_WRITE) |
//         //                                             (portPMP_REGION_ADDR_MATCH_NA4));
//         // addr_modifier ( xPmpInfo.granularity,
//         //                 ( size_t ) __unprivileged_data_section_start__,
//         //                 (size_t *) &xTaskListTasksShowDefinition.xRegions[0].pvBaseAddress);

// 				// High address 
//         xTaskListTasksShowDefinition.xRegions[1].ulLengthInBytes = 4;
//         xTaskListTasksShowDefinition.xRegions[1].ulParameters = ((portPMP_REGION_READ_WRITE) |
//                                                     (portPMP_REGION_ADDR_MATCH_TOR));

//         addr_modifier ( xPmpInfo.granularity,
//                         ( size_t ) __unprivileged_data_section_end__,
//                         (size_t *) &xTaskListTasksShowDefinition.xRegions[1].pvBaseAddress);

// #ifdef METAL_SIFIVE_UART0
//     // allow access to UART peripheral
//         xTaskListTasksShowDefinition.xRegions[2].ulLengthInBytes = METAL_SIFIVE_UART0_0_SIZE;
//         xTaskListTasksShowDefinition.xRegions[2].ulParameters = ((portPMP_REGION_READ_WRITE) |
//                                                      (portPMP_REGION_ADDR_MATCH_NAPOT));

