Samsung/mTower/arch/riscv32/bl808/src/pine64_ox64/nonsecure/main.c
//         napot_addr_modifier (	xPmpInfo.granularity,
//                                 (size_t) METAL_SIFIVE_UART0_0_BASE_ADDRESS,
//                                 (size_t *) &xTaskListTasksShowDefinition.xRegions[2].pvBaseAddress,
//                                 xTaskListTasksShowDefinition.xRegions[2].ulLengthInBytes);
// #endif /* METAL_SIFIVE_UART0 */

//         // xTaskListTasksShowDefinition.puxStackBuffer = ( StackType_t * ) pvPortMalloc( xTaskListTasksShowDefinition.usStackDepth * sizeof( StackType_t ) );
// //         // xTaskListTasksShowDefinition.puxStackBuffer = xTaskListTasksShowStack;

// 		printf("xTaskListTasksShowDefinition.puxStackBuffer = %p\r\n", xTaskListTasksShowDefinition.puxStackBuffer);
// // 		// printf("Test = ");
// // 		// print_stack_pointer();
//         xTaskCreateRestricted(  &xTaskListTasksShowDefinition,
//                                 &xHandle_TaskListTasks);

		/* Start the tasks and timer running. */
		vTaskStartScheduler();

	/* If all is well, the scheduler will now be running, and the following
	line will never be reached.  If the following line does execute, then
	there was insufficient FreeRTOS heap memory available for the Idle and/or
	timer tasks to be created. 
	or task have stoppped the Scheduler */

		// vTaskDelete( xHandle_SendTask );
		// vTaskDelete( xHandle_ReceiveTask );
	// }
// #endif /* ( portUSING_MPU_WRAPPERS == 1 ) */
}

/*-----------------------------------------------------------*/

static void prvQueueSendTask( void *pvParameters )
{
	TickType_t xNextWakeTime;
	BaseType_t xReturned;
	unsigned long ulCounter = 0;

	/* Remove compiler warning about unused parameter. */
	( void ) pvParameters;
	( void ) xReturned;

	/* Initialise xNextWakeTime - this only needs to be done once. */
	xNextWakeTime = xTaskGetTickCount();

	for( ; ; )
	{
		printf("[ Tx ] : %d\r\n", ++ulCounter );

		/* Place this task in the blocked state until it is time to run again. */
		vTaskDelayUntil( &xNextWakeTime, mainQUEUE_TICK_COUNT_FOR_1S);
		// vTaskDelay( mainQUEUE_TICK_COUNT_FOR_1S * 500);


		/* Send to the queue - causing the queue receive task to unblock and
		toggle the LED.  0 is used as the block time so the sending operation
		will not block - it shouldn't need to block as the queue should always
		be empty at this point in the code. */
		xReturned = xQueueSend( xQueue, &ulCounter, 0U );
		configASSERT( xReturned == pdPASS );
	}

	/** 
	 * SiFive CI/CD need to have a exit(0) status to pass
	 */
#if( portUSING_MPU_WRAPPERS == 1 )
	/* We run into user mode, so need to be machine mode before to call vTaskEndScheduler */
	// xPortRaisePrivilege();
#endif /* ( portUSING_MPU_WRAPPERS == 1 ) */
	// vTaskEndScheduler();
}
/*-----------------------------------------------------------*/

static void prvQueueReceiveTask( void *pvParameters )
{
	unsigned long ulReceivedValue;

	/* Remove compiler warning about unused parameter. */
	( void ) pvParameters;

	for( ;; )
	{
		/* Wait until something arrives in the queue - this task will block
		indefinitely provided INCLUDE_vTaskSuspend is set to 1 in
		FreeRTOSConfig.h. */
		xQueueReceive( xQueue, &ulReceivedValue, portMAX_DELAY );

		/*  To get here something must have been received from the queue, but
		is it the expected value?  If it is, toggle the LED. */

		printf("[ Rx ] : %d\r\n", ulReceivedValue );
	}
}
/*-----------------------------------------------------------*/

static void prvSetupHardware( void )
{
	// const char * const pcWarningMsg = "At least one of LEDs is null.\r\n";
    board_init();
    uart0 = bflb_device_get_by_name("uart0");
	// // This demo will toggle LEDs colors so we define them here
	// led0_red = metal_led_get_rgb("LD0", "red");
	// led0_green = metal_led_get_rgb("LD0", "green");
	// led0_blue = metal_led_get_rgb("LD0", "blue");
	// if ((led0_red == NULL) || (led0_green == NULL) || (led0_blue == NULL))
	// {
	// 	write( STDOUT_FILENO, pcWarningMsg, strlen( pcWarningMsg ) );
	// }
	// else
	// {
	// 	// Enable each LED
	// 	metal_led_enable(led0_red);
	// 	metal_led_enable(led0_green);
	// 	metal_led_enable(led0_blue);

	// 	// All Off
	// 	metal_led_on(led0_red);
	// 	metal_led_on(led0_green);
	// 	metal_led_on(led0_blue);
	// }
}
/*-----------------------------------------------------------*/


void vApplicationMallocFailedHook( void )
{
	/* vApplicationMallocFailedHook() will only be called if
	configUSE_MALLOC_FAILED_HOOK is set to 1 in FreeRTOSConfig.h.  It is a hook
	function that will get called if a call to pvPortMalloc() fails.
	pvPortMalloc() is called internally by the kernel whenever a task, queue,
	timer or semaphore is created.  It is also called by various parts of the
	demo application.  If heap_1.c or heap_2.c are used, then the size of the
	heap available to pvPortMalloc() is defined by configTOTAL_HEAP_SIZE in
	FreeRTOSConfig.h, and the xPortGetFreeHeapSize() API function can be used
	to query the size of free heap space that remains (although it does not
	provide information on how the remaining heap might be fragmented). */

	const char * const pcErrorMsg = "ERROR malloc \r\n";

	taskDISABLE_INTERRUPTS();

// #if( portUSING_MPU_WRAPPERS == 1 )
// 	/* need to be machine mode */
// 	xPortRaisePrivilege();
// #endif /* ( portUSING_MPU_WRAPPERS == 1 ) */
	printf(pcErrorMsg);
// 	write( STDOUT_FILENO, pcErrorMsg, strlen(pcErrorMsg) );

// 	if ( led0_red != NULL )
// 	{
// 		// Red light on
// 		metal_led_off(led0_red);
// 	}

	_exit(1);
}
/*-----------------------------------------------------------*/

// void vApplicationIdleHook( void )
// {
// 	/* vApplicationIdleHook() will only be called if configUSE_IDLE_HOOK is set
// 	to 1 in FreeRTOSConfig.h.  It will be called on each iteration of the idle
// 	task.  It is essential that code added to this hook function never attempts
// 	to block in any way (for example, call xQueueReceive() with a block time
// 	specified, or call vTaskDelay()).  If the application makes use of the
// 	vTaskDelete() API function (as this demo application does) then it is also
// 	important that vApplicationIdleHook() is permitted to return to its calling
// 	function, because it is the responsibility of the idle task to clean up
// 	memory allocated by the kernel to any task that has since been deleted. */
// }
// /*-----------------------------------------------------------*/

// void vApplicationStackOverflowHook( TaskHandle_t pxTask, char *pcTaskName )
// {
// 	( void ) pcTaskName;
// 	( void ) pxTask;

// 	/* Run time stack overflow checking is performed if
// 	configCHECK_FOR_STACK_OVERFLOW is defined to 1 or 2.  This hook
// 	function is called if a stack overflow is detected. */
// 	taskDISABLE_INTERRUPTS();

// 	write( STDOUT_FILENO, "ERROR Stack overflow on func: ", 30 );
// 	write( STDOUT_FILENO, pcTaskName, strlen( pcTaskName ) );
// 	write( STDOUT_FILENO, "\r\n", 3 );

// 	// if ( led0_red != NULL )
// 	// {
// 	// 	// Red light on
// 	// 	metal_led_off(led0_red);
// 	// }

// 	_exit(1);
// }
// /*-----------------------------------------------------------*/

// void vApplicationTickHook( void )
// {
// 	/* The tests in the full demo expect some interaction with interrupts. */
// }
// /*-----------------------------------------------------------*/

// void vAssertCalled( void )
// {
// 	taskDISABLE_INTERRUPTS();

// 	if ( led0_red != NULL )
// 	{
// 		// Red light on
// 		metal_led_off(led0_red);
// 	}

// 	_exit(1);
// }

